Revit 2027 API
ColumnAttachment.TargetId Property
 The id of the element that is attached to the column and is described by this ColumnAttachment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TargetId { get; }
Public ReadOnly Property TargetId As ElementId
	Get
public:
property ElementId^ TargetId {
	ElementId^ get ();
}
member TargetId : ElementId with get
Property Value
ElementId
See Also
Reference
ColumnAttachment Class
Autodesk.Revit.DB Namespace